<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');

//	医院编号
$config['result']	=	array(
	'1'=>'北京大区',
	'2'=>'山东大区',
	'3'=>'广海大区',
	'4'=>'上海大区',
	'5'=>'天河大区',
	'6'=>'浙江大区',
	'7'=>'东北大区',
	'8'=>'福建大区',
	'9'=>'华中大区',
	'10'=>'江安大区',
	'11'=>'西北大区',
	'12'=>'西南大区',
	);
	
$config['result1']	=	array(
	'BJ01'=>'北京人民医院',
	'BJ02'=>'卫生部北京医院',
	'BJ03'=>'北京医科大学附属第一医院',
	'BJ04'=>'北京中日友好医院'
);

$config['result2']	=	array(
	'SD01'=>'山东大学齐鲁医院',
	'SD02'=>'山东省立医院'
);

$config['result3']	=	array(
	'GH01'=>'广东省人民医院',
	'GH02'=>'中山大学附属第二医院',
	'GH03'=>'中山大学孙逸仙纪念医院'
);

$config['result4']	=	array(
	'SH01'=>'上海市第一人民医院',
	'SH02'=>'长征医院',
	'SH03'=>'华山医院'
);

$config['result5']	=	array(
	'TH01'=>'天津医科大学代谢病医院',
	'TH02'=>'天津武警医学院附属医院'
);

$config['result6']	=	array(
	'ZA01'=>'浙江大学医学院附属第二医院',
	'ZA02'=>'浙江大学医学院附属邵逸夫医院',
	'ZA03'=>'温州医科大学附属第一医院',
);


$config['result7']	=	array(
	'DB01'=>'哈尔滨医科大学附属第一医院'
);

$config['result8']	=	array(
	'FJ01'=>'福建医科大学附属第一医院',
	'FJ02'=>'南京军区福州总医院'
);

$config['result9']	=	array(
	'HZ01'=>'华中科技大学附属同济医院',
	'HZ02'=>'华中科技大学附属协和医院'
);


$config['result10']	=	array(
	'JA01'=>'鼓楼医院',
	'JA02'=>'南京军区总医院',
	'JS03'=>'徐州医学院附属医院徐州第二人民医院'
);

$config['result11']	=	array(
	'XB01'=>'新疆维吾尔自治区人民医院',
	'XB02'=>'西京医院'
);

$config['result12']	=	array(
	'XN01'=>'四川省人民医院',
	'XN02'=>'重庆医科大学附属第二医院'
);

